public class Main {
    public static void main(String[] args) {
        float Tiket = 56_500.25f;
        int Mili = (int)Tiket / 20;
        System.out.println("У вас " + Mili + " миль");
    }
}
//    Авиаперевозчики предлагают различные бонусные программы, начисляющие бесплатные мили за перелёты.
//        Формула следующая: за каждые 20 рублей, потраченные на билет, начисляется 1 миля.
//        Что вам нужно: создать приложение, рассчитывающее количество начисленных мили за купленный билет.
//        Стоимость билета вы выбираете сами (сами создайте переменную, в которой она будет храниться).
//        Итого: у вас должен быть репозиторий на GitHub, в котором расположен ваш Java-код.